# MetalType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Metal..::..MetalType Property
Metal Class See Also
---
The property labeled "Type" from the "Metal" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string MetalType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MetalType As String
	Get
```

Visual C++
---
```text
public:
static property String^ MetalType {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalType".
# See Also
Metal Class
Autodesk.Revit.DB.Visual Namespace